---
kind: method
id: M:Autodesk.Revit.DB.FabricationConfiguration.GetFabricationConnectorGroup(System.Int32)
source: html/23aa9453-cc47-939b-c691-341f9b8bf3a6.htm
---
# Autodesk.Revit.DB.FabricationConfiguration.GetFabricationConnectorGroup Method

Gets the fabrication connector group from its identifier.

## Syntax (C#)
```csharp
public string GetFabricationConnectorGroup(
	int fabricationConnectorId
)
```

## Parameters
- **fabricationConnectorId** (`System.Int32`) - The fabrication connector identifier.

## Returns
The fabrication connector's group.